[Killed] BlockStatement
main/components/Users/UsersTable.js:18:49
     }
 
     // toggleDriver return
-    function cellToAxiosParamsToggleDriver(cell){
-        return {
-            url: "/api/admin/users/toggleDriver", 
-            method:  "POST",
-            params: {
-                id: cell.row.values.id
-            }
-        }
-    }
+    function cellToAxiosParamsToggleDriver(cell){}
 
     // Stryker disable all : hard to test for query caching
killedBy: AdminUsersPage tests usertable toggle driver tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Users/UsersTable.js:44:49
 
    // Stryker restore all 
 
-    const toggleAdminCallback = async (cell) => { toggleAdminMutation.mutate(cell); }
+    const toggleAdminCallback = async (cell) => {}
     const toggleDriverCallback = async (cell) => { toggleDriverMutation.mutate(cell); }
 
killedBy: AdminUsersPage tests usertable toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Users/UsersTable.js:55:21
             accessor: 'id', 
         },
         {
-            Header: 'First Name',
+            Header: "",
             accessor: 'givenName',
         },
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: First Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Users/UsersTable.js:73:17
         },
         {
             Header: 'Driver',
-            id: 'driver',
+            id: "",
             accessor: (row, _rowIndex) => String(row.driver) 
         }
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-driver"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
main/components/Users/UsersTable.js:74:23
         {
             Header: 'Driver',
             id: 'driver',
-            accessor: (row, _rowIndex) => String(row.driver) 
+            accessor: () => undefined 
         }
     ];
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:

[Killed] StringLiteral
main/components/Users/UsersTable.js:82:38
         // shows all the text columns, and then the button columns
         ...columns,
 
-        ButtonColumn("toggle-admin", "primary", toggleAdminCallback, "UsersTable"),
+        ButtonColumn("toggle-admin", "", toggleAdminCallback, "UsersTable"),
         ButtonColumn("toggle-driver", "primary", toggleDriverCallback, "UsersTable"),
     ]   
killedBy: UserTable tests ButtonColumn should have type primary
statusReason: Error: expect(element).toHaveClass("btn btn-primary")

Expected the element to have class:
  btn btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/Users/UsersTable.js:83:72
         ...columns,
 
         ButtonColumn("toggle-admin", "primary", toggleAdminCallback, "UsersTable"),
-        ButtonColumn("toggle-driver", "primary", toggleDriverCallback, "UsersTable"),
+        ButtonColumn("toggle-driver", "primary", toggleDriverCallback, ""),
     ]   
 
killedBy: AdminUsersPage tests usertable toggle driver tests
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-toggle-driver-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
