[Killed] ObjectLiteral
main/components/Nav/AppNavbar.js:16:49
           <AppNavbarLocalhost url={currentUrl} />
         )
       }
-      <Navbar expand="xl" variant="dark" style={{ backgroundColor: "#003660" }} sticky="top" data-testid="AppNavbar">
+      <Navbar expand="xl" variant="dark" style={{}} sticky="top" data-testid="AppNavbar">
         <Container>
           <img data-testid="AppNavImage" src={headerImg} alt="" style={{
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: expect(element).toHaveStyle()

- Expected

- background-color: rgb(0, 54, 96);
