[Killed] BlockStatement
main/components/Users/UsersTable.js:9:49
 
 export default function UsersTable({ users}) {
 
-    function cellToAxiosParamsToggleAdmin(cell) {
-        return {
-            url: "/api/admin/users/toggleAdmin",
-            method: "POST",
-            params: {
-                id: cell.row.values.id
-            }
-        }
-    }
+    function cellToAxiosParamsToggleAdmin(cell) {}
 
     // Stryker disable all : hard to test for query caching
killedBy: AdminUsersPage tests usertable toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Users/UsersTable.js:11:18
 
     function cellToAxiosParamsToggleAdmin(cell) {
         return {
-            url: "/api/admin/users/toggleAdmin",
+            url: "",
             method: "POST",
             params: {
killedBy: AdminUsersPage tests usertable toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/admin/users/toggleAdmin"
Received: ""

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:13:21
         return {
             url: "/api/admin/users/toggleAdmin",
             method: "POST",
-            params: {
-                id: cell.row.values.id
-            }
+            params: {}
         }
     }
killedBy: AdminUsersPage tests usertable toggle admin tests
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 1,
- }
