[Killed] StringLiteral
main/components/RideRequests/RideRequestForm.js:6:76
 import { useForm } from 'react-hook-form';
 import { useNavigate } from 'react-router-dom';
 
-function RideRequestForm({ initialRideRequest, submitAction, buttonLabel = "Create" }) {
+function RideRequestForm({ initialRideRequest, submitAction, buttonLabel = "" }) {
 
     // Stryker disable all
killedBy: RideRequestForm tests renders correctly
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RideRequests/RideRequestForm.js:59:41
                     id="day"
                     type='text'
                     isInvalid={Boolean(errors.day)}
-                    {...register("day", { required: "Day is required" })}
+                    {...register("day", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: RideRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Day is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RideRequests/RideRequestForm.js:73:44
                     id="course"
                     type="text"
                     isInvalid={Boolean(errors.localDateTime)}
-                    {...register("course", { required: "Course is required" })}
+                    {...register("course", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: RideRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Course is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RideRequests/RideRequestForm.js:73:34
                     id="course"
                     type="text"
                     isInvalid={Boolean(errors.localDateTime)}
-                    {...register("course", { required: "Course is required" })}
+                    {...register("", { required: "Course is required" })}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: RideRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/RideRequests/RideRequestForm.js:87:47
                     id="startTime"
                     type="text"
                     isInvalid={Boolean(errors.startTime)}
-                    {...register("startTime", {
-                        required: "Start Time is required."
-                    })}
+                    {...register("startTime", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: RideRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Start Time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RideRequests/RideRequestForm.js:87:34
                     id="startTime"
                     type="text"
                     isInvalid={Boolean(errors.startTime)}
-                    {...register("startTime", {
+                    {...register("", {
                         required: "Start Time is required."
                     })}
killedBy: RideRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/RideRequests/RideRequestForm.js:92:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.startTime?.message}
+                    {errors.startTime.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RideRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/RideRequests/RideRequestForm.js:103:34
                     id="stopTime"
                     type="text"
                     isInvalid={Boolean(errors.stopTime)}
-                    {...register("stopTime", {
+                    {...register("", {
                         required: "Stop Time is required."
                     })}
killedBy: RideRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/RideRequests/RideRequestForm.js:108:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.stopTime?.message}
+                    {errors.stopTime.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RideRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/RideRequests/RideRequestForm.js:119:34
                     id="building"
                     type="text"
                     isInvalid={Boolean(errors.building)}
-                    {...register("building", {
+                    {...register("", {
                         required: "Building is required."
                     })}
killedBy: RideRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/RideRequests/RideRequestForm.js:120:35
                     type="text"
                     isInvalid={Boolean(errors.building)}
                     {...register("building", {
-                        required: "Building is required."
+                        required: ""
                     })}
                 />
killedBy: RideRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Building is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/RideRequests/RideRequestForm.js:124:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.building?.message}
+                    {errors.building.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RideRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] OptionalChaining
main/components/RideRequests/RideRequestForm.js:156:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.pickupLocation?.message}
+                    {errors.pickupLocation.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RideRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
